experiment/raw/recreate_run10_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.972ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.635ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.97ms  373.43ms   2.73s    95.62%
    Req/Sec     2.62     20.34   400.00     98.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.31ms
 75.000%    4.33ms
 90.000%    9.47ms
 99.000%    2.25s 
 99.900%    2.51s 
 99.990%    2.74s 
 99.999%    2.74s 
100.000%    2.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.797     0.000000            1         1.00
       2.007     0.100000           55         1.11
       2.435     0.200000          110         1.25
       2.701     0.300000          165         1.43
       2.979     0.400000          220         1.67
       3.307     0.500000          274         2.00
       3.467     0.550000          302         2.22
       3.623     0.600000          329         2.50
       3.785     0.650000          357         2.86
       4.043     0.700000          384         3.33
       4.331     0.750000          411         4.00
       4.631     0.775000          425         4.44
       5.015     0.800000          439         5.00
       5.335     0.825000          453         5.71
       5.839     0.850000          466         6.67
       7.435     0.875000          480         8.00
       8.391     0.887500          487         8.89
       9.903     0.900000          494        10.00
      11.743     0.912500          501        11.43
      17.007     0.925000          507        13.33
      27.743     0.937500          514        16.00
      61.279     0.943750          518        17.78
     341.503     0.950000          521        20.00
     662.527     0.956250          525        22.86
    1139.711     0.962500          528        26.67
    1204.223     0.968750          531        32.00
    1464.319     0.971875          533        35.56
    1937.407     0.975000          535        40.00
    2001.919     0.978125          538        45.71
    2001.919     0.981250          538        53.33
    2003.967     0.984375          542        64.00
    2003.967     0.985938          542        71.11
    2003.967     0.987500          542        80.00
    2254.847     0.989062          543        91.43
    2254.847     0.990625          543       106.67
    2260.991     0.992188          545       128.00
    2260.991     0.992969          545       142.22
    2260.991     0.993750          545       160.00
    2285.567     0.994531          546       182.86
    2285.567     0.995313          546       213.33
    2285.567     0.996094          546       256.00
    2510.847     0.996484          547       284.44
    2510.847     0.996875          547       320.00
    2510.847     0.997266          547       365.71
    2510.847     0.997656          547       426.67
    2510.847     0.998047          547       512.00
    2736.127     0.998242          548       568.89
    2736.127     1.000000          548          inf
#[Mean    =       82.975, StdDeviation   =      373.433]
#[Max     =     2734.080, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.42KB read
  Non-2xx or 3xx responses: 19
Requests/sec:      5.02
Transfer/sec:      1.21KB