experiment/raw/recreate_run1_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.409ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.349ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.40ms  292.73ms   2.40s    95.99%
    Req/Sec     2.62     20.63   500.00     98.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.18ms
 75.000%    4.36ms
 90.000%    5.94ms
 99.000%    2.00s 
 99.900%    2.00s 
 99.990%    2.40s 
 99.999%    2.40s 
100.000%    2.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.706     0.000000            1         1.00
       1.885     0.100000           55         1.11
       2.215     0.200000          110         1.25
       2.607     0.300000          165         1.43
       2.881     0.400000          220         1.67
       3.183     0.500000          274         2.00
       3.365     0.550000          304         2.22
       3.615     0.600000          329         2.50
       3.847     0.650000          357         2.86
       4.071     0.700000          384         3.33
       4.359     0.750000          411         4.00
       4.519     0.775000          425         4.44
       4.631     0.800000          440         5.00
       4.779     0.825000          453         5.71
       4.999     0.850000          467         6.67
       5.355     0.875000          480         8.00
       5.631     0.887500          487         8.89
       5.943     0.900000          495        10.00
       6.371     0.912500          501        11.43
       6.639     0.925000          507        13.33
       6.951     0.937500          514        16.00
       7.443     0.943750          518        17.78
       8.815     0.950000          521        20.00
      14.167     0.956250          525        22.86
     403.199     0.962500          528        26.67
     805.887     0.968750          531        32.00
    1203.199     0.971875          536        35.56
    1203.199     0.975000          536        40.00
    1207.295     0.978125          538        45.71
    1207.295     0.981250          538        53.33
    1605.631     0.984375          540        64.00
    1786.879     0.985938          541        71.11
    2002.943     0.987500          547        80.00
    2002.943     0.989062          547        91.43
    2002.943     0.990625          547       106.67
    2002.943     0.992188          547       128.00
    2002.943     0.992969          547       142.22
    2002.943     0.993750          547       160.00
    2002.943     0.994531          547       182.86
    2002.943     0.995313          547       213.33
    2002.943     0.996094          547       256.00
    2002.943     0.996484          547       284.44
    2002.943     0.996875          547       320.00
    2002.943     0.997266          547       365.71
    2002.943     0.997656          547       426.67
    2002.943     0.998047          547       512.00
    2404.351     0.998242          548       568.89
    2404.351     1.000000          548          inf
#[Mean    =       58.398, StdDeviation   =      292.725]
#[Max     =     2402.304, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.35KB read
  Non-2xx or 3xx responses: 18
Requests/sec:      5.02
Transfer/sec:      1.21KB