experiment/raw/recreate_run2_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.975ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.127ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   141.01ms  634.25ms   4.64s    94.89%
    Req/Sec     2.63     20.74   444.00     98.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.93ms
 75.000%    4.13ms
 90.000%    6.13ms
 99.000%    3.85s 
 99.900%    4.65s 
 99.990%    4.65s 
 99.999%    4.65s 
100.000%    4.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.759     0.000000            1         1.00
       1.649     0.100000           55         1.11
       2.091     0.200000          110         1.25
       2.411     0.300000          166         1.43
       2.685     0.400000          220         1.67
       2.935     0.500000          274         2.00
       3.117     0.550000          302         2.22
       3.343     0.600000          329         2.50
       3.615     0.650000          357         2.86
       3.831     0.700000          384         3.33
       4.127     0.750000          411         4.00
       4.315     0.775000          425         4.44
       4.679     0.800000          439         5.00
       4.903     0.825000          453         5.71
       5.231     0.850000          466         6.67
       5.707     0.875000          480         8.00
       5.899     0.887500          487         8.89
       6.131     0.900000          494        10.00
       6.543     0.912500          501        11.43
       7.287     0.925000          507        13.33
      23.103     0.937500          514        16.00
     467.199     0.943750          518        17.78
     910.335     0.950000          521        20.00
    1454.079     0.956250          525        22.86
    1708.031     0.962500          528        26.67
    2003.967     0.968750          531        32.00
    2250.751     0.971875          533        35.56
    2254.847     0.975000          535        40.00
    3051.519     0.978125          537        45.71
    3053.567     0.981250          538        53.33
    3205.119     0.984375          540        64.00
    3454.975     0.985938          541        71.11
    3661.823     0.987500          542        80.00
    3850.239     0.989062          544        91.43
    3850.239     0.990625          544       106.67
    3850.239     0.992188          544       128.00
    4407.295     0.992969          546       142.22
    4407.295     0.993750          546       160.00
    4407.295     0.994531          546       182.86
    4407.295     0.995313          546       213.33
    4407.295     0.996094          546       256.00
    4648.959     0.996484          548       284.44
    4648.959     1.000000          548          inf
#[Mean    =      141.013, StdDeviation   =      634.248]
#[Max     =     4644.864, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.83KB read
  Non-2xx or 3xx responses: 25
Requests/sec:      5.02
Transfer/sec:      1.22KB