experiment/raw/recreate_run3_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.517ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.410ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.97ms  368.62ms   2.65s    95.07%
    Req/Sec     2.65     19.05   400.00     97.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.17ms
 75.000%    4.08ms
 90.000%    5.41ms
 99.000%    2.05s 
 99.900%    2.45s 
 99.990%    2.65s 
 99.999%    2.65s 
100.000%    2.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.596     0.000000            1         1.00
       2.205     0.100000           55         1.11
       2.453     0.200000          110         1.25
       2.731     0.300000          165         1.43
       2.959     0.400000          221         1.67
       3.171     0.500000          274         2.00
       3.319     0.550000          302         2.22
       3.513     0.600000          329         2.50
       3.675     0.650000          357         2.86
       3.863     0.700000          384         3.33
       4.079     0.750000          411         4.00
       4.199     0.775000          425         4.44
       4.391     0.800000          439         5.00
       4.535     0.825000          454         5.71
       4.691     0.850000          466         6.67
       5.087     0.875000          480         8.00
       5.283     0.887500          487         8.89
       5.431     0.900000          494        10.00
       5.863     0.912500          501        11.43
       6.583     0.925000          507        13.33
       8.495     0.937500          514        16.00
      10.599     0.943750          518        17.78
     407.039     0.950000          521        20.00
     636.927     0.956250          525        22.86
    1244.159     0.962500          528        26.67
    1264.639     0.968750          531        32.00
    1434.623     0.971875          533        35.56
    1649.663     0.975000          535        40.00
    1906.687     0.978125          537        45.71
    2000.895     0.981250          538        53.33
    2003.967     0.984375          540        64.00
    2040.831     0.985938          541        71.11
    2041.855     0.987500          542        80.00
    2045.951     0.989062          543        91.43
    2045.951     0.990625          543       106.67
    2062.335     0.992188          544       128.00
    2232.319     0.992969          546       142.22
    2232.319     0.993750          546       160.00
    2232.319     0.994531          546       182.86
    2232.319     0.995313          546       213.33
    2232.319     0.996094          546       256.00
    2449.407     0.996484          547       284.44
    2449.407     0.996875          547       320.00
    2449.407     0.997266          547       365.71
    2449.407     0.997656          547       426.67
    2449.407     0.998047          547       512.00
    2652.159     0.998242          548       568.89
    2652.159     1.000000          548          inf
#[Mean    =       82.970, StdDeviation   =      368.616]
#[Max     =     2650.112, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.57KB read
  Non-2xx or 3xx responses: 21
Requests/sec:      5.02
Transfer/sec:      1.21KB